package com.zza.tgbot.ui.widget

import android.util.Log
import androidx.compose.foundation.clickable
import androidx.compose.runtime.Composable
import androidx.compose.runtime.LaunchedEffect
import androidx.compose.runtime.mutableStateOf
import androidx.compose.runtime.remember
import androidx.compose.ui.Modifier
import androidx.compose.ui.platform.LocalContext
import androidx.compose.ui.viewinterop.AndroidView
import com.zza.tgbot.ui.widget.lrc.LrcView
import com.zza.tgbot.utils.CommonUtil.doAsync
import kotlinx.coroutines.delay
import java.io.File

@Composable
fun LrcWidgetView(modifier: Modifier = Modifier) {
    Log.e("zza", "10000")
    val time = remember { mutableStateOf(0L) }
    AndroidView(factory = { LrcView(it) }, modifier = modifier.clickable {
        time.value += 10000
    }) {
        it.setDraggable(
            true
        ) { view, time ->
            Log.e("zza", "${time}")
            it.updateTime(time)
            true
        }
        it.loadLrc(s)

    }
}

@Composable
fun LrcPlayerTest(modifier: Modifier = Modifier) {
    LrcWidgetView(modifier)
}

val s = "[00:00.00]02 洗澡时的甜蜜手交\n" +
        "[00:03.02]那就让姐姐帮你脱掉衣服 转到这边来吧\n" +
        "[00:16.17]嗯 那么举起手哦\n" +
        "[00:21.94]对\n" +
        "[00:30.48]今天的身体也非常帅气\n" +
        "[00:35.30]你的身体是世界上最帅气的\n" +
        "[00:41.18]我已经喜欢到想一直看下去了\n" +
        "[00:48.62]真帅啊\n" +
        "[00:50.98]啊 一直看着的话会感冒的 对不起\n" +
        "[00:59.36]那么裤子和内裤也脱掉吧\n" +
        "[01:09.65]好 欧金金露出来了\n" +
        "[01:15.48]不用害羞 你的欧金金非常雄伟 可爱哦\n" +
        "[01:24.98]姐姐我最喜欢了 所以没有什么好害羞的哦\n" +
        "[01:31.45]那姐姐也把衣服脱了吧\n" +
        "[01:46.64]好 让你久等了\n" +
        "[01:52.50]虽然因为接下来要洗澡所以裸体是理所当然的\n" +
        "[02:01.02]但还是会有一点心跳加速呢\n" +
        "[02:05.58]呐 你喜欢姐姐的身体吗\n" +
        "[02:14.48]这样啊 我很开心\n" +
        "[02:17.71]姐姐的身体 无论是胸还是屁股\n" +
        "[02:23.24]重要的部位全部都是属于你的哦\n" +
        "[02:29.66]可以按照你的喜好来使用哦\n" +
        "[02:34.74]那么就去洗澡吧\n" +
        "[02:40.90]那么在进浴缸之前把身体洗干净吧\n" +
        "[02:49.12]姐姐会帮你洗干净的 所以你就坐在那边的凳子上吧\n" +
        "[02:59.32]先把身体洗一遍\n" +
        "[03:05.95]在手心挤上沐浴露\n" +
        "[03:10.63]那我开始洗了\n" +
        "[03:14.19]像是温柔地按摩那样\n" +
        "[03:20.21]姐姐我其实很喜欢给你洗身体\n" +
        "[03:27.22]毕竟能尽情抚摸你健壮 世界第一帅气的身体\n" +
        "[03:35.58]真的非常~幸福\n" +
        "[03:39.42]不管是你还是你的身体 姐姐我都最喜欢了哦\n" +
        "[03:49.67]脖颈 肩膀 从上臂 到手心\n" +
        "[04:10.03]感觉有点心动了\n" +
        "[04:14.14]那么把手臂举起来\n" +
        "[04:18.77]嗯 腋下也要认真清洗干净\n" +
        "[04:33.92]好 手臂可以放下来了哦\n" +
        "[04:38.36]接下来是胸口\n" +
        "[04:41.72]你厚实的胸口和乳头\n" +
        "[04:49.46]你很喜欢我触碰这里吧\n" +
        "[04:53.76]乳~头~\n" +
        "[04:58.26]用滑溜溜的沐浴露泡泡洗洗乳头吧\n" +
        "[05:06.04]来洗干净吧\n" +
        "[05:12.68]啊嘞 身体开始向后仰了\n" +
        "[05:17.80]乳头被涂抹上滑溜溜的沐浴露 身体有感觉了吧\n" +
        "[05:26.56]开发完毕的乳头很舒服吧\n" +
        "[05:34.42]啊 享受快感的你真可爱\n" +
        "[05:40.94]为什么你会这么可爱啊\n" +
        "[05:44.41]又可爱又帅气 真是太犯规了\n" +
        "[05:53.44]最喜欢你了\n" +
        "[05:56.18]那要不就在姐姐的身体上涂满沐浴露\n" +
        "[06:06.17]然后抱住你 用身体给你洗怎么样\n" +
        "[06:21.05]双方滑溜溜的身体互相摩擦\n" +
        "[06:29.77]这样洗澡感觉怎么样\n" +
        "[06:40.44]看 姐姐的乳头和你的乳头互相摩擦着\n" +
        "[06:51.59]非常的舒服吧\n" +
        "[07:01.27]姐姐的乳头也非常敏感\n" +
        "[07:08.39]所以这样摩擦会很舒服\n" +
        "[07:23.21]沐浴露的润滑效果真的非常棒\n" +
        "[07:28.74]让勃起的乳头感受着这份润滑感\n" +
        "[07:37.54]真舒服啊 乳头真舒服啊\n" +
        "[07:48.07]喜欢 喜欢你哦\n" +
        "[07:52.93]姐姐我最喜欢你了 世界第一喜欢你\n" +
        "[08:02.77]能和最喜欢的你贴在一起享受快感\n" +
        "[08:11.46]我真的非常幸福\n" +
        "[08:36.04]让我帮你舔耳朵吧\n" +
        "[09:14.92]呐 像这样互相摩擦身体感觉很刺激吧\n" +
        "[09:25.67]感觉自己变的非常好色\n" +
        "[09:48.88]你也 和我一样吧 会变的非常好色吧\n" +
        "[10:01.10]刚才开始就有根硬硬的东西 顶着姐姐肚子下方哦\n" +
        "[10:12.26]欧金金噗噗地勃起 顶到姐姐了\n" +
        "[10:23.64]勃起肉棒又粗又热 真的非常棒\n" +
        "[10:34.71]肉棒对着姐姐变的这么大 我非常开心\n" +
        "[11:00.46]呐 我要开始抚摸肉棒了哦\n" +
        "[11:07.46]让我来给坚挺勃起的肉棒按摩一下\n" +
        "[11:17.56]让我来安抚他一下\n" +
        "[11:23.84]肉棒真乖 肉棒真乖\n" +
        "[11:34.21]欧金金真棒 欧金金真棒\n" +
        "[11:42.18]裸体状态下被裸体姐姐抱着 舔耳\n" +
        "[11:49.72]被滑溜溜的身体摩擦着 下身都已经这样了啊\n" +
        "[11:57.55]真棒 真是个好孩子\n" +
        "[12:04.14]那我就握住肉棒 来帮你撸动一下吧\n" +
        "[12:18.08]这个力度可以吗\n" +
        "[12:33.07]肉棒滑溜溜的 这个是因为沐浴露吗\n" +
        "[12:43.42]还是说是因为忍耐汁\n" +
        "[12:50.61]忍耐汁和沐浴露混合在一起 散发着非常色情的气味\n" +
        "[12:59.82]两个都有？我好开心\n" +
        "[13:05.34]欧金金像这样流出忍耐汁 姐姐很开心\n" +
        "[13:11.95]那么就继续吧\n" +
        "[13:38.22]一边舔耳一边撸动肉棒\n" +
        "[13:48.47]肉棒真乖 肉棒真乖\n" +
        "[13:55.54]你的世界上最帅的肉棒 真的非常乖呢\n" +
        "[14:27.06]那接下来就稍微切换一下玩法\n" +
        "[14:33.33]用右手撸动肉棒 左手抚摸蛋蛋\n" +
        "[14:43.41]像这样温柔按摩的话蛋蛋会非常开心的\n" +
        "[14:50.90]然后制造大量的精子\n" +
        "[14:58.30]揉一揉蛋蛋~撸一撸肉棒~\n" +
        "[15:19.87]蛋蛋和肉棒我都会好好宠爱的\n" +
        "[15:28.08]所以尽情制造精子喷射出来吧\n" +
        "[15:52.32]最喜欢你了哦 姐姐我最喜欢你了\n" +
        "[16:00.84]好好舒服一下吧\n" +
        "[16:08.92]啊 好厉害\n" +
        "[16:13.40]身体颤抖着 从肉棒里流出了好多忍耐汁\n" +
        "[16:23.44]姐姐的手都拉着下流的丝线哦\n" +
        "[16:30.76]把这些湿滑的液体涂抹在整个肉棒上\n" +
        "[16:39.59]从龟头到根部上下撸动\n" +
        "[16:57.97]啊 突然用力抱紧姐姐 看来是很舒服吧\n" +
        "[17:08.53]真可爱啊\n" +
        "[17:10.92]可以哦 你可以就这样一直抱着我哦\n" +
        "[17:18.42]姐姐会让你更舒服的\n" +
        "[17:23.08]在射出白色的液体之前姐姐都会继续宠爱肉棒的\n" +
        "[17:33.21]就像这样\n" +
        "[17:48.92]肉棒真乖 肉棒真乖\n" +
        "[17:57.24]很舒服吧 肉棒很舒服吧\n" +
        "[18:06.55]你享受快感的表情真的非常可爱哦\n" +
        "[18:12.85]我最喜欢了\n" +
        "[18:17.13]手上的速度再快一点吧\n" +
        "[18:43.78]呐 想射的话随时都可以射哦\n" +
        "[18:51.56]可以享受姐姐的手交\n" +
        "[18:55.56]从雄壮的肉棒中尽情喷射出白色的液体哦\n" +
        "[19:15.29]已经到极限了吗\n" +
        "[19:18.06]可以哦 射出来吧\n" +
        "[19:45.22]来 射吧\n" +
        "[19:47.26]尽情喷射出色情浓稠的精液吧\n" +
        "[19:50.25]精液射出来吧\n" +
        "[19:52.58]射吧 射吧\n" +
        "[19:54.27]要射了 要射了 要射了\n" +
        "[19:55.76]精液要出来了 肉棒要biubiu的射精了\n" +
        "[19:59.50]肉棒被姐姐疼爱着要射出来了\n" +
        "[20:09.90]射了 射了 biu~biu~\n" +
        "[20:15.74]biubiubiu~~~\n" +
        "[20:21.96]真的射了好多\n" +
        "[20:28.36]肉棒射了这么多真棒\n" +
        "[20:34.01]好孩子 好孩子 肉棒很厉害哦\n" +
        "[20:40.59]感觉怎么样 舒服吗\n" +
        "[20:45.42]是吗 姐姐我很开心哦\n" +
        "[20:50.70]快感爆发时的你真的非常可爱 我最喜欢了哦"